Revit 2026 API

# BumpMapBumpmapType Property

---

The property labeled "Bump Type" from the "BumpMap" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string BumpmapType { get; }
```
```vb
Public Shared ReadOnly Property BumpmapType As String
	Get
```
```cpp
public:
static property String^ BumpmapType {
	String^ get ();
}
```
```fsharp
static member BumpmapType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "BumpmapType".

#### Reference

BumpMap Class

Autodesk.Revit.DB.Visual Namespace